In [24]:
import pandas as pd
import glob
import os

path = "D:\\New folder (2)\\quantium-task-1-model-answer_forage\\data"

all_files = glob.glob(os.path.join(path, "*.csv"))

df_list = [pd.read_csv(file) for file in all_files]
combined_df = pd.concat(df_list, ignore_index=True)

print(combined_df.head())

       product  price  quantity        date region
0  pink morsel  $3.00       546  2018-02-06  north
1  pink morsel  $3.00       549  2018-02-06  south
2  pink morsel  $3.00       577  2018-02-06   east
3  pink morsel  $3.00       519  2018-02-06   west
4  gold morsel  $9.99       580  2018-02-06  north

In [25]:
combined_df=combined_df[combined_df['product']=='pink morsel']

In [26]:
combined_df

           product  price  quantity        date region
0      pink morsel  $3.00       546  2018-02-06  north
1      pink morsel  $3.00       549  2018-02-06  south
2      pink morsel  $3.00       577  2018-02-06   east
3      pink morsel  $3.00       519  2018-02-06   west
28     pink morsel  $3.00       529  2018-02-07  north
...            ...    ...       ...         ...    ...
41107  pink morsel  $5.00       478  2022-02-13   west
41132  pink morsel  $5.00       407  2022-02-14  north
41133  pink morsel  $5.00       493  2022-02-14  south
41134  pink morsel  $5.00       500  2022-02-14   east
41135  pink morsel  $5.00       423  2022-02-14   west

[5880 rows x 5 columns]

In [27]:
combined_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5880 entries, 0 to 41135
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   product   5880 non-null   object
 1   price     5880 non-null   object
 2   quantity  5880 non-null   int64
 3   date      5880 non-null   object
 4   region    5880 non-null   object
dtypes: int64(1), object(4)
memory usage: 275.6+ KB

In [29]:

combined_df['price'] = (
    combined_df['price']
    .str.replace(r'[$,]', '', regex=True) 
    .astype(float)                          
)

combined_df['sales'] = combined_df['price'] * combined_df['quantity']

In [21]:
combined_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5880 entries, 0 to 41135
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   product   5880 non-null   object
 1   price     0 non-null      float64
 2   quantity  5880 non-null   int64
 3   date      5880 non-null   object
 4   region    5880 non-null   object
 5   sales     0 non-null      float64
dtypes: float64(2), int64(1), object(3)
memory usage: 321.6+ KB

In [22]:
combined_df['sales']=combined_df['price']*combined_df['quantity']

In [30]:
combined_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5880 entries, 0 to 41135
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   product   5880 non-null   object
 1   price     5880 non-null   float64
 2   quantity  5880 non-null   int64
 3   date      5880 non-null   object
 4   region    5880 non-null   object
 5   sales     5880 non-null   float64
dtypes: float64(2), int64(1), object(3)
memory usage: 321.6+ KB

In [31]:
combined_df

           product  price  quantity        date region   sales
0      pink morsel    3.0       546  2018-02-06  north  1638.0
1      pink morsel    3.0       549  2018-02-06  south  1647.0
2      pink morsel    3.0       577  2018-02-06   east  1731.0
3      pink morsel    3.0       519  2018-02-06   west  1557.0
28     pink morsel    3.0       529  2018-02-07  north  1587.0
...            ...    ...       ...         ...    ...     ...
41107  pink morsel    5.0       478  2022-02-13   west  2390.0
41132  pink morsel    5.0       407  2022-02-14  north  2035.0
41133  pink morsel    5.0       493  2022-02-14  south  2465.0
41134  pink morsel    5.0       500  2022-02-14   east  2500.0
41135  pink morsel    5.0       423  2022-02-14   west  2115.0

[5880 rows x 6 columns]

In [32]:
combined_df=combined_df.drop(columns=['price', 'quantity'])

In [33]:
combined_df

           product        date region   sales
0      pink morsel  2018-02-06  north  1638.0
1      pink morsel  2018-02-06  south  1647.0
2      pink morsel  2018-02-06   east  1731.0
3      pink morsel  2018-02-06   west  1557.0
28     pink morsel  2018-02-07  north  1587.0
...            ...         ...    ...     ...
41107  pink morsel  2022-02-13   west  2390.0
41132  pink morsel  2022-02-14  north  2035.0
41133  pink morsel  2022-02-14  south  2465.0
41134  pink morsel  2022-02-14   east  2500.0
41135  pink morsel  2022-02-14   west  2115.0

[5880 rows x 4 columns]

In [34]:
combined_df.isnull().sum()

product    0
date       0
region     0
sales      0
dtype: int64

In [35]:
combined_df

           product        date region   sales
0      pink morsel  2018-02-06  north  1638.0
1      pink morsel  2018-02-06  south  1647.0
2      pink morsel  2018-02-06   east  1731.0
3      pink morsel  2018-02-06   west  1557.0
28     pink morsel  2018-02-07  north  1587.0
...            ...         ...    ...     ...
41107  pink morsel  2022-02-13   west  2390.0
41132  pink morsel  2022-02-14  north  2035.0
41133  pink morsel  2022-02-14  south  2465.0
41134  pink morsel  2022-02-14   east  2500.0
41135  pink morsel  2022-02-14   west  2115.0

[5880 rows x 4 columns]